#ifndef FOC_TRANSFORM_H
#define FOC_TRANSFORM_H

#include "zf_common_headfile.h"

/*===========================================================================*/
/*  Clark变换输出                                                             */
/*===========================================================================*/
typedef struct
{
    float Alpha;            /* Alpha轴分量 */
    float Beta;             /* Beta轴分量 */
} Clark_t;

/*===========================================================================*/
/*  Park变换输出                                                              */
/*===========================================================================*/
typedef struct
{
    float Id;               /* d轴分量 */
    float Iq;               /* q轴分量 */
} Park_t;

/*===========================================================================*/
/*  逆Park变换输入                                                            */
/*===========================================================================*/
typedef struct
{
    float Ud;               /* d轴分量 */
    float Uq;               /* q轴分量 */
} InversePark_t;

/*===========================================================================*/
/*  逆Park变换输出                                                            */
/*===========================================================================*/
typedef struct
{
    float Ualpha;           /* Alpha轴分量 */
    float Ubeta;            /* Beta轴分量 */
} AlphaBeta_t;


/*==================================================== 基础函数 ====================================================*/
Clark_t         foc_clark_calc          (float CurrentA, float CurrentB);
Park_t          foc_park_calc           (Clark_t Clark, uint16 ElectricalAngle);
AlphaBeta_t     foc_ipark_calc          (InversePark_t InversePark, uint16 ElectricalAngle);
/*==================================================== 基础函数 ====================================================*/

#endif
